Repository: ntoporcov/openclient
Catalog: OpenCodeIOSClient/Localizable.xcstrings
Source language: en
Languages: it, pt_br

source: OC Notify pairing is not available from this plugin. Update the plugin and try again.
it: L'abbinamento di OC Notify non è disponibile da questo plugin. Aggiorna il plugin e riprova.
pt_br: O emparelhamento do OC Notify não está disponível neste plugin. Atualize o plugin e tente novamente.

source: OC Notify pairing timed out. Try again.
it: L'abbinamento di OC Notify è scaduto. Riprova.
pt_br: O emparelhamento do OC Notify expirou. Tente novamente.

source: OC Notify returned an invalid setup response.
it: OC Notify ha restituito una risposta di configurazione non valida.
pt_br: O OC Notify retornou uma resposta de configuração inválida.

source: OC Notify setup is not available from this plugin.
it: La configurazione di OC Notify non è disponibile da questo plugin.
pt_br: A configuração do OC Notify não está disponível neste plugin.

source: Okay, give me a second.
it: Va bene, dammi un secondo.
pt_br: Certo, só um segundo.

source: Older
it: Meno recenti
pt_br: Mais antigas

source: Once
it: Una volta
pt_br: Uma vez

source: Once you connect to a server, the app loads your projects, discovers sessions for the selected directory, and starts listening for live events. The goal is to make the UI feel less like a remote terminal and more like a native client for the same OpenCode workflow you already know from the main app.
it: Una volta connesso a un server, l'app carica i tuoi progetti, individua le sessioni per la cartella selezionata e inizia ad ascoltare gli eventi in tempo reale. L'obiettivo è far sembrare l'interfaccia meno un terminale remoto e più un client nativo per lo stesso flusso di lavoro OpenCode che già conosci dall'app principale.
pt_br: Depois que você se conecta a um servidor, o app carrega seus projetos, descobre as sessões do diretório selecionado e começa a escutar eventos em tempo real. O objetivo é fazer a UI parecer menos um terminal remoto e mais um cliente nativo para o mesmo fluxo de trabalho do OpenCode que você já conhece no app principal.

source: One moment while I think.
it: Un momento mentre ci penso.
pt_br: Um momento enquanto penso.

source: One view across projects
it: Una vista unica su tutti i progetti
pt_br: Uma visão de todos os projetos

source: One-time purchase + Pro Life icon
it: Acquisto una tantum + icona Pro Life
pt_br: Compra única + ícone Pro Life

source: Open a page in the in-app browser first.
it: Apri prima una pagina nel browser dell'app.
pt_br: Abra primeiro uma página no navegador do aplicativo.

source: Open a webpage
it: Apri una pagina web
pt_br: Abrir uma página web

source: Open Activity from Projects to follow working sessions, requests that need input, and recent conversations together.
it: Apri Attività da Progetti per seguire insieme le sessioni in lavorazione, le richieste che necessitano di input e le conversazioni recenti.
pt_br: Abra Atividade em Projetos para acompanhar, em um só lugar, sessões em andamento, solicitações que precisam de resposta e conversas recentes.

source: Open After Auto-Connect
it: Apri dopo la connessione automatica
pt_br: Abrir após conexão automática

source: Open Again
it: Apri di nuovo
pt_br: Abrir novamente

source: Open Authorization Page
it: Apri pagina di autorizzazione
pt_br: Abrir Página de Autorização

source: Open browser
it: Apri browser
pt_br: Abrir navegador

source: Open Browser
it: Apri browser
pt_br: Abrir navegador

source: Open Chat in New Window
it: Apri la chat in una nuova finestra
pt_br: Abrir conversa em uma nova janela

source: Open chats in new windows
it: Apri le chat in nuove finestre
pt_br: Abra chats em novas janelas

source: Open composer menu
it: Apri il menu di composizione
pt_br: Abrir menu de composição

source: Open link to %@
it: Apri link a %@
pt_br: Abrir link para %@

source: Open Plugin Notification Setup
it: Apri la configurazione delle notifiche del plugin
pt_br: Abrir configuração de notificações do plugin

source: Open that origin in Safari, add OC Notify to the Home Screen, then pair it with the separate code generated on the host.
it: Apri quell'origine in Safari, aggiungi OC Notify alla schermata Home, quindi abbinalo usando il codice separato generato sull'host.
pt_br: Abra essa origem no Safari, adicione o OC Notify à Tela de Início e emparelhe-o usando o código separado gerado no host.

source: Open the app once before sharing to this connection.
it: Apri l'app una volta prima di condividere con questa connessione.
pt_br: Abra o aplicativo uma vez antes de compartilhar com esta conexão.

source: Open the app to reconnect the server used by this widget.
it: Apri l'app per riconnettere il server usato da questo widget.
pt_br: Abra o aplicativo para reconectar o servidor usado por este widget.

source: Open the provider authorization page in your default browser.
it: Apri la pagina di autorizzazione del provider nel browser predefinito.
pt_br: Abra a página de autorização do provedor no navegador padrão.

source: Open the session to see the conversation.
it: Apri la sessione per vedere la conversazione.
pt_br: Abra a sessão para ver a conversa.

source: OpenClient Browser
it: Browser OpenClient
pt_br: Navegador do OpenClient

source: OpenClient Connection
it: Connessione OpenClient
pt_br: Conexão OpenClient

source: OpenClient could not send the Live Activity response.
it: OpenClient non è riuscito a inviare la risposta dell'attività in tempo reale.
pt_br: O OpenClient não pôde enviar a resposta da Atividade ao Vivo.

source: OpenClient couldn't connect to this server. Try again, or browse downloaded chats in read-only mode.
it: OpenClient non è riuscito a connettersi a questo server. Riprova oppure consulta le chat scaricate in modalità di sola lettura.
pt_br: O OpenClient não conseguiu se conectar a este servidor. Tente novamente ou veja os chats baixados no modo somente leitura.

source: OpenClient couldn't load the configured plugins.
it: OpenClient non è riuscito a caricare i plugin configurati.
pt_br: OpenClient não pôde carregar os plugins configurados.

source: OpenClient Diagnostics
it: Diagnostica OpenClient
pt_br: Diagnósticos do OpenClient

source: OpenClient exists because the OpenCode maintainers and contributors have built the server, SDK, app patterns, and product language that this native client follows. Their work makes it possible for this app to stay aligned with the broader OpenCode ecosystem instead of becoming a separate one-off client.
it: OpenClient esiste perché i maintainer e i contributor di OpenCode hanno costruito il server, l'SDK, i pattern dell'app e il linguaggio di prodotto che questo client nativo segue. Il loro lavoro permette a questa app di restare allineata al più ampio ecosistema OpenCode invece di diventare un client isolato a sé stante.
pt_br: O OpenClient existe porque os mantenedores e colaboradores do OpenCode criaram o servidor, o SDK, os padrões do app e a linguagem de produto que este cliente nativo segue. Esse trabalho permite que o app permaneça alinhado ao ecossistema mais amplo do OpenCode, em vez de se tornar um cliente isolado.

source: OpenClient follows the same philosophy
it: OpenClient segue la stessa filosofia
pt_br: OpenClient segue a mesma filosofia

source: OpenClient includes software and services whose licenses or terms require attribution in distributed builds.
it: OpenClient include software e servizi le cui licenze o condizioni richiedono attribuzione nelle build distribuite.
pt_br: O OpenClient inclui softwares e serviços cujas licenças ou termos exigem atribuição nas builds distribuídas.

source: OpenClient is now available in Brazilian Portuguese across the app and its extensions.
it: OpenClient è ora disponibile in portoghese brasiliano nell'app e nelle sue estensioni.
pt_br: O OpenClient agora está disponível em português do Brasil em todo o app e suas extensões.

source: OpenClient is now available in Italian across the app and its extensions.
it: OpenClient è ora disponibile in italiano nell'app e nelle sue estensioni.
pt_br: O OpenClient agora está disponível em italiano em todo o app e suas extensões.

source: OpenClient is reading only the selected provider credential. Its value will not be shown.
it: OpenClient sta leggendo solo la credenziale del provider selezionato. Il suo valore non verrà mostrato.
pt_br: O OpenClient está lendo somente a credencial do provedor selecionado. O valor não será exibido.

source: OpenClient is using experimental v2 support. If something doesn’t work as expected, please report a bug.
it: OpenClient sta usando il supporto sperimentale alla v2. Se qualcosa non funziona come previsto, segnala un bug.
pt_br: O OpenClient está usando suporte experimental à v2. Se algo não funcionar como esperado, relate um bug.

source: OpenClient Model
it: Modello OpenClient
pt_br: Modelo OpenClient

source: OpenClient needs your permission before it asks the connected OpenCode server to read this provider credential. If the read succeeds, OpenClient automatically stores the credential in Keychain and sends it only to the selected provider's usage API for this check and future refreshes. The value stays hidden.
it: OpenClient richiede la tua autorizzazione prima di chiedere al server OpenCode connesso di leggere questa credenziale del provider. Se la lettura riesce, OpenClient archivia automaticamente la credenziale nel Portachiavi e la invia solo all'API di utilizzo del provider selezionato per questa verifica e per gli aggiornamenti futuri. Il valore rimane nascosto.
pt_br: O OpenClient precisa da sua permissão antes de pedir ao servidor OpenCode conectado para ler esta credencial do provedor. Se a leitura for bem-sucedida, o OpenClient armazenará automaticamente a credencial nas Chaves e a enviará somente à API de uso do provedor selecionado para esta consulta e futuras atualizações. O valor permanece oculto.

source: OpenClient now speaks Brazilian Portuguese and Italian, throughout the app and beyond.
it: OpenClient ora parla portoghese brasiliano e italiano, nell'app e non solo.
pt_br: Agora o OpenClient fala português do Brasil e italiano em todo o app e além.

source: OpenClient Plugin
it: Plugin OpenClient
pt_br: Plugin do OpenClient

source: OPENCLIENT PLUGIN
it: PLUGIN OPENCLIENT
pt_br: PLUGIN DO OPENCLIENT

source: OpenClient Plugin: Connected
it: Plugin OpenClient: connesso
pt_br: Plugin do OpenClient: conectado

source: OpenClient Pro is not available yet.
it: OpenClient Pro non è ancora disponibile.
pt_br: OpenClient Pro ainda não está disponível.

source: OpenClient Project
it: Progetto OpenClient
pt_br: Projeto OpenClient

source: OpenClient scans the connected OpenCode host on ports 4070 through 4090. The network is expected to be protected by your Tailnet, VPN, or firewall.
it: OpenClient scansiona l'host OpenCode connesso sulle porte da 4070 a 4090. La rete deve essere protetta dalla tua Tailnet, VPN o firewall.
pt_br: OpenClient verifica o host OpenCode conectado nas portas 4070 a 4090. Espera-se que a rede esteja protegida por seu Tailnet, VPN ou firewall.

source: OpenClient searched for PNG, JPG, and JPEG files in this project.
it: OpenClient ha cercato file PNG, JPG e JPEG in questo progetto.
pt_br: OpenClient pesquisou os arquivos PNG, JPG e JPEG neste projeto.

source: OpenClient Session
it: Sessione OpenClient
pt_br: Sessão OpenClient

source: OpenClient speaks each completed answer while longer work continues, with Talk visible on the Lock Screen and Dynamic Island.
it: OpenClient pronuncia ogni risposta completata mentre le attività più lunghe continuano, con Talk visibile nella schermata di blocco e nella Dynamic Island.
pt_br: O OpenClient fala cada resposta concluída enquanto trabalhos mais longos continuam, com o Talk visível na Tela Bloqueada e na Ilha Dinâmica.

source: OpenClient will connect to the selected server when the app opens. Server passwords remain in Keychain.
it: OpenClient si connetterà al server selezionato all'apertura dell'app. Le password del server restano nel Portachiavi.
pt_br: OpenClient se conectará ao servidor selecionado quando o aplicativo for aberto. As senhas do servidor permanecem em Keychain.

source: OpenClient will reconnect automatically.
it: OpenClient si riconnetterà automaticamente.
pt_br: OpenClient se reconectará automaticamente.

source: OpenClient, in your language
it: OpenClient, nella tua lingua
pt_br: OpenClient, no seu idioma

source: OpenClient, this native iPhone client, is being built with the same spirit. The goal is not just to wrap the server in a mobile shell, but to create a first-class open client whose behavior, UI direction, and technical tradeoffs can all be reviewed and improved in public.
it: OpenClient, questo client nativo per iPhone, viene costruito con lo stesso spirito. L'obiettivo non è solo avvolgere il server in un guscio mobile, ma creare un client aperto di prima classe il cui comportamento, direzione dell'interfaccia e compromessi tecnici possano essere tutti rivisti e migliorati pubblicamente.
pt_br: O OpenClient, este cliente nativo para iPhone, está sendo desenvolvido com o mesmo espírito. O objetivo não é apenas envolver o servidor em uma interface móvel, mas criar um cliente aberto de primeira classe cujo comportamento, direção de UI e decisões técnicas possam ser analisados e aprimorados publicamente.

source: OpenClient's sketch attachment tool uses the @excalidraw/excalidraw React library to provide a local, offline drawing board inside the app. Thanks to the Excalidraw maintainers and contributors for making a high-quality open source diagramming tool available to embed in developer workflows. Project: https://github.com/excalidraw/excalidraw
it: Lo strumento di disegno di OpenClient usa la libreria React @excalidraw/excalidraw per offrire una lavagna di disegno locale e offline all'interno dell'app. Grazie ai maintainer e ai contributor di Excalidraw per aver reso disponibile uno strumento di diagramming open source di alta qualità da integrare nei flussi di lavoro degli sviluppatori. Progetto: https://github.com/excalidraw/excalidraw
pt_br: A ferramenta de anexo de esboço do OpenClient usa a biblioteca @excalidraw/excalidraw React para fornecer uma prancheta de desenho local off-line dentro do aplicativo. Agradecemos aos mantenedores e contribuidores do Excalidraw por disponibilizarem uma ferramenta de diagramação de código aberto de alta qualidade para incorporar nos fluxos de trabalho do desenvolvedor. Projeto: https://github.com/excalidraw/excalidraw

source: OpenCode accepted the prompt. Chat will open with this message already in place.
it: OpenCode ha accettato il prompt. La chat si aprirà con questo messaggio già pronto.
pt_br: OpenCode aceitou o prompt. O chat será aberto com esta mensagem já inserida.

source: OpenCode and OpenClient are part of an open workflow: inspect the code, follow the discussions, and help shape what comes next.
it: OpenCode e OpenClient fanno parte di un flusso di lavoro aperto: ispeziona il codice, segui le discussioni e aiuta a plasmare ciò che verrà dopo.
pt_br: OpenCode e OpenClient fazem parte de um fluxo de trabalho aberto: inspecione o código, acompanhe as discussões e ajude a moldar o que vem a seguir.

source: OpenCode did not remove this worktree.
it: OpenCode non ha rimosso questo worktree.
pt_br: O OpenCode não removeu este worktree.

source: OpenCode did not reset this worktree.
it: OpenCode non ha reimpostato questo worktree.
pt_br: O OpenCode não redefiniu este worktree.

source: OpenCode in one sentence
it: OpenCode in una frase
pt_br: OpenCode em uma frase

source: OpenCode is a coding workspace built around an AI agent that can read context, answer questions, use tools, and help move a project forward from inside a persistent session. The iPhone client is meant to keep that same model intact while making it feel natural on a smaller, touch-first screen.
it: OpenCode è uno spazio di lavoro di programmazione costruito attorno a un agente IA che può leggere il contesto, rispondere a domande, usare strumenti e aiutare a far progredire un progetto dall'interno di una sessione persistente. Il client per iPhone è pensato per mantenere intatto questo stesso modello, facendolo sentire naturale su uno schermo più piccolo e touch-first.
pt_br: O OpenCode é um espaço de trabalho de programação centrado em um agente de IA capaz de ler contexto, responder perguntas, usar ferramentas e ajudar um projeto a avançar dentro de uma sessão persistente. O cliente para iPhone mantém esse mesmo modelo e o adapta de forma natural a uma tela menor e voltada ao toque.

source: OpenCode is not a black box product you have to trust blindly. The project is developed in the open, which means the architecture, discussions, and implementation choices can be inspected directly by the people who use it.
it: OpenCode non è un prodotto scatola nera di cui fidarsi ciecamente. Il progetto è sviluppato in modo aperto, il che significa che l'architettura, le discussioni e le scelte implementative possono essere ispezionate direttamente da chi lo usa.
pt_br: OpenCode não é um produto de caixa preta em que você deve confiar cegamente. O projeto é desenvolvido de forma aberta, o que significa que a arquitetura, as discussões e as opções de implementação podem ser inspecionadas diretamente pelas pessoas que o utilizam.

source: OpenCode is open source
it: OpenCode è open source
pt_br: OpenCode é de código aberto

source: OpenCode is still preparing this worktree. Try again in a moment.
it: OpenCode sta ancora preparando questo worktree. Riprova tra un momento.
pt_br: O OpenCode ainda está preparando este worktree. Tente novamente em instantes.

source: OpenCode provider discovery only suggests credential sources. It does not determine which usage providers are supported.
it: Il rilevamento dei provider OpenCode suggerisce solo le origini delle credenziali. Non determina quali provider di utilizzo sono supportati.
pt_br: A descoberta de provedores do OpenCode apenas sugere origens de credenciais. Ela não determina quais provedores de uso são compatíveis.

source: OpenCode rejected the prompt.
it: OpenCode ha rifiutato il prompt.
pt_br: O OpenCode rejeitou o prompt.

source: OpenCode v2 detected
it: OpenCode v2 rilevato
pt_br: OpenCode v2 detectado

source: OpenCode v2, ready to try
it: OpenCode v2, pronto da provare
pt_br: OpenCode v2, pronto para experimentar

source: OpenCode will create a separate git worktree before sending.
it: OpenCode creerà un worktree git separato prima dell'invio.
pt_br: O OpenCode criará um worktree git separado antes do envio.

source: OpenCode will create a separate git worktree, then start this session inside it.
it: OpenCode creerà un worktree git separato, poi avvierà questa sessione al suo interno.
pt_br: O OpenCode criará um worktree git separado e iniciará esta sessão nele.

source: OpenCode will start the OAuth flow and store the resulting credentials on the server.
it: OpenCode avvierà il flusso OAuth e memorizzerà le credenziali risultanti sul server.
pt_br: OpenCode iniciará o fluxo OAuth e armazenará as credenciais resultantes no servidor.

source: Opening %@
it: Apertura di %@
pt_br: Abrindo %@

source: Opening the event stream so tokens can arrive at warp speed.
it: Apertura del flusso di eventi per far arrivare i token a velocità curvatura.
pt_br: Abrindo o fluxo de eventos para que os tokens possam chegar em alta velocidade.

source: Opening the plugin bridge on port %lld.
it: Apertura del bridge del plugin sulla porta %lld.
pt_br: Abrindo a ponte de plugins na porta %lld.

source: Opens an interactive preview with zoom and text selection
it: Apre un'anteprima interattiva con zoom e selezione del testo
pt_br: Abre uma prévia interativa com zoom e seleção de texto

source: Opens in your browser
it: Si apre nel tuo browser
pt_br: Abre no seu navegador

source: Optional
it: Facoltativo
pt_br: Opcional

source: Optional title
it: Titolo opzionale
pt_br: Título opcional

source: Options
it: Opzioni
pt_br: Opções

source: Orange
it: Arancione
pt_br: Laranja

source: Other
it: Altro
pt_br: Outro

source: Other period
it: Altro periodo
pt_br: Outro período

source: Output Tokens
it: Token di output
pt_br: Tokens de saída

source: Part ID
it: ID parte
pt_br: ID da parte

source: paste
it: incolla
pt_br: colar

source: Pasted image
it: Immagine incollata
pt_br: Imagem colada

source: Pasted image could not be read.
it: Impossibile leggere l'immagine incollata.
pt_br: A imagem colada não pôde ser lida.

source: Patch Diff
it: Diff della patch
pt_br: Diff do patch

source: Patch Diffs
it: Diff delle patch
pt_br: Diffs de patches

source: Pause
it: Pausa
pt_br: Pausar

source: PERMISSION
it: PERMESSO
pt_br: PERMISSÃO

source: Permission requested for the release command.
it: Autorizzazione richiesta per il comando di release.
pt_br: Permissão solicitada para o comando de release.

source: Personal Voice
it: Voce personale
pt_br: Voz Pessoal

source: Personal Voice access is allowed.
it: L'accesso a Voce personale è consentito.
pt_br: O acesso à Voz Pessoal está permitido.

source: Personal Voice access was denied. You can change this in Settings.
it: L'accesso a Voce personale è stato negato. Puoi modificarlo nelle Impostazioni.
pt_br: O acesso à Voz Pessoal foi negado. Você pode alterar isso nos Ajustes.

source: Personal Voice is not available on this device.
it: Voce personale non è disponibile su questo dispositivo.
pt_br: A Voz Pessoal não está disponível neste dispositivo.

source: Photo
it: Foto
pt_br: Foto

source: Photos
it: Foto
pt_br: Fotos

source: Pick the path that matches your risk tolerance.
it: Scegli il percorso adatto alla tua tolleranza al rischio.
pt_br: Escolha o caminho que corresponda à sua tolerância ao risco.

source: Pie chart
it: Grafico a torta
pt_br: Gráfico de pizza

source: Pin
it: Fissa
pt_br: Fixar

source: Pink
it: Rosa
pt_br: Rosa

source: Pinned
it: Fissato
pt_br: Fixado

source: Plan
it: Piano
pt_br: Plano

source: Play
it: Riproduci
pt_br: Reproduzir

source: Play %@
it: Riproduci %@
pt_br: Reproduzir %@

source: Playing
it: In riproduzione
pt_br: Reproduzindo

source: Please try again.
it: Riprova.
pt_br: Por favor, tente novamente.

source: Plugin tools are ready in OpenCode.
it: Gli strumenti del plugin sono pronti in OpenCode.
pt_br: As ferramentas de plugin estão prontas em OpenCode.

source: Plugins
it: Plugin

source: Plugins configured in `opencode.json`
it: Plugin configurati in `opencode.json`
pt_br: Plugins configurados em `opencode.json`

source: Plugins Unavailable
it: Plugin non disponibili
pt_br: Plugins indisponíveis

source: Polish Activity cards
it: Rifinisci le card Attività
pt_br: Aprimorar cartões de Atividade

source: Pondering
it: Ponderando
pt_br: Pensando

source: Popular
it: Popolare

source: Port forwarding is possible, but discouraged
it: Il port forwarding è possibile, ma sconsigliato
pt_br: O encaminhamento de porta é possível, mas desencorajado

source: Preferences unavailable
it: Preferenze non disponibili
pt_br: Preferências indisponíveis

source: Preparing
it: Preparazione in corso
pt_br: Preparando

source: Preparing a fresh workspace before the session opens.
it: Preparazione di un nuovo workspace prima dell'apertura della sessione.
pt_br: Preparando um novo espaço de trabalho antes da abertura da sessão.

source: Preparing attachments
it: Preparazione allegati
pt_br: Preparando anexos

source: Preparing fork
it: Preparazione fork
pt_br: Preparando fork

source: Preparing fork...
it: Preparazione fork...
pt_br: Preparando fork...

source: Preparing interface
it: Preparazione interfaccia
pt_br: Preparando interface

source: Preparing notification setup...
it: Preparazione della configurazione delle notifiche...
pt_br: Preparando a configuração de notificações...

source: Preparing OAuth...
it: Preparazione OAuth...
pt_br: Preparando OAuth...
